---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSTEPImportLinkAvailable
source: html/991fc253-96ab-4219-ed2c-4df6f6726088.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsSTEPImportLinkAvailable Method

Checks whether the STEP Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsSTEPImportLinkAvailable()
```

## Returns
True if the STEP Import/Link functionality is available in the installed Revit.

## Remarks
STEP Import/Link is optional functionality that does not have to be a part of the Revit installation.